import re
#小葫芦大数据的信息整理
#演示页：https://h5.xiaohulu.com/liveShare?plat=73&roomid=2200834760225&videoPlat=0
x=r"""

大咖详情

李湘

明星大咖

红人概览
直播分析
收回场次选择

数据说明

最近一场销售额最高观众人数最多客单价最高观众人均付费最高峰值在线人数最高
日期选择

2020-09-01

时间选择

20:2119:41

李湘2020-09-01 20:21场

已结束直播时长 4h41m


本场总销售额

17.1万元


本场订单数量

2926


人均付费额

0.3元


商品平均客单价

58.3元


本场总PV

61.8万


本场新增粉丝

288

本场数据趋势
销售额
 订单量 PV
本场上架商品(26)

【保税速发】泰国雨巢冰糖即食燕窝正品 孕妇营养滋补品75ml*6瓶

售价:￥164 销量:310

销售额:5.08万

【李湘小助理推荐】东来也苹果11手机壳国潮玻璃苹果11promax手机壳原创苹果保护套男华为手机壳oppo玻璃壳女

售价:￥68 销量:226

销售额:1.54万

【粉丝专享】美国进口拜耳oneaday小粒装160粒补充多种维生素

售价:￥129 销量:102

销售额:1.32万

马迭尔冰棍 网红冰淇淋原味榴莲芒果香草抹茶朗姆酒6口味11支雪糕

售价:￥98 销量:118

销售额:1.16万

李湘美妆店 爱敬age20s气垫时尚镭射bb霜遮瑕保湿控油持久不脱妆

售价:￥158 销量:57

销售额:9006

第一卫手机支架桌面ipad平板懒人万能pad通用支撑架托架直播支夹伸缩家用固定升降直播pro床头架子多功能金属

售价:￥35 销量:255

销售额:8925

春雪爆汁鸡米花净重4斤原味冷冻油炸鸡胸块无骨鸡柳鸡排清真食品

售价:￥81.90 销量:104

销售额:8518

运动百搭塑型裤

售价:￥49 销量:168

销售额:8232

家用创意六边形冰块模具冰箱冰盒DIY做冰格自制冰储存盒冰格

售价:￥19.90 销量:339

销售额:6746

李湘美妆店 韩国ELROEL亮白保湿自然遮瑕隔离粉底棒妆前打底提亮

售价:￥148 销量:43

销售额:6364

植观蓬蓬粉头发蓬松神器刘海去油控油蓬松粉免洗干发粉喷喷粉便携

售价:￥19.90 销量:272

销售额:5413

好想你大红枣夹核桃仁218gx2袋新疆和田骏枣夹心零食免洗枣子核桃

售价:￥31.90 销量:158

销售额:5040

小斑鹿婴儿理发器超静音自动吸发充电儿童家用宝宝剃头发理发神器

售价:￥69 销量:72

销售额:4968

星仔岛紫菜干货50g头水免洗紫菜蛋花汤水产海鲜干货干紫菜坛紫菜

售价:￥8.80 销量:488

销售额:4294

第一卫适用于苹果7背夹充电宝X背夹式iPhone7Plus一体充8超薄6s电池xr专用6p后背11手机壳xsmax夹背式iPhonex

售价:￥84 销量:49

销售额:4116

允宝足浴球精油泡脚球泡脚丸泡澡沐浴球气泡弹泡泡浴球浴盐男女

售价:￥149 销量:18

销售额:2682

霜山日式棉被收纳袋子棉麻整理袋布艺衣服被子透气防水防潮防尘袋

售价:￥49 销量:53

销售额:2597

Soap & Glory蜜糖迷恋身体磨砂膏 300ml光滑嫩肤去角质蜜糖味

售价:￥85 销量:14

销售额:1190

李湘美妆店 韩国莉碧儿毛孔细致黑炭面膜收敛毛孔效期至2021年6月

售价:￥29 销量:40

销售额:1160

星仔岛淡干虾皮干货非特级无盐即食小虾米新鲜海米海鲜温州红虾皮

售价:￥19.90 销量:20

销售额:398

干发帽女超强吸水速干包头巾加厚速干帽擦头发速干毛巾干发巾浴帽

售价:￥5.10 销量:20

销售额:102

㊙顶诺尊品澳洲进口原肉整切牛排套餐新鲜菲力西冷黑椒牛扒10片20

售价:￥198 销量:0

销售额:0

施华蔻专业线OSIS刚劲定型喷雾发胶300ml官网3号干胶男女清香自然

售价:￥58 销量:0

销售额:0

肆方食斋手工小麻花零食138g*4袋烧烤海苔休闲办公零食小吃

售价:￥9.90 销量:0

销售额:0

朵拉朵尚沐浴露持久留香氛体家用家庭装烟酰胺男女士香水沐浴乳液

售价:￥64.90 销量:0

销售额:0

直播间中奖售后联系

售价:￥9999 销量:0

销售额:0
更多红人数据
加入对比
分享给朋友

"""

y=r"""(汪涵)|(本场上架商品)"""
y2="""2020-.{2}-.{2}|.{2}:.{2}|汪涵-向美好出发|本场总销售额|本场总销售额|人均付费额|商品平均客单价|本场总PV|本场新增粉丝"""
z=""
z2=""
m=0
n=-3
s=False
s2=False
up=False
x1=list(x.split('\n'))
for x11 in x1:
    m=m+1
    if m < 20:
        if x11 != "":
            if re.search(y2,x11):
                print(x11)
    if m>=27 and m<60:
        if x11 != "":
            if re.search(y2,x11):
                s2=True
                z2=x11
            elif s2==True:
                s2 = False
                z2=z2+"|"+x11
                print(z2)
    if re.search(r"本场上架商品", x11):
        up = True
    if m>=60 and up:
        if x11!="":
            if (not re.search(r"销售额",x11)) or len(x11)>11:
                if re.search(r"本场上架商品",x11):
                    s=True
                    z=""
                if s==True:
                    if re.search(r"本场上架商品",x11):
                        x11=""
                        n=-1
                    if n==-1:pass
                    else:
                        z=z+"|"+x11
                    n=n+1
                    if n==2 and s==True:
                        z=z.replace("售价:￥","").replace(" 销量:","|")
                        print(z)
                        z=""
                        n=0
                else:
                    pass

